app/Controllers/Admin/Auth.php

    public function process()
    {
        $session  = session();
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari user di database
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'aurelj'
 LIMIT 1