app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $projectModel   = new ProjectModel();
        $skillModel     = new SkillModel();
        $educationModel = new EducationModel();

        // Mengambil seluruh baris data dari database untuk dihitung jumlahnya di view dashboard
        $data = [
            'title'     => 'Dashboard Admin',
            'projects'  => $projectModel->findAll(),
            'skills'    => $skillModel->findAll(),
            'education' => $educationModel->findAll()
---
SELECT *
FROM `projects`
SELECT *
FROM `skills`
SELECT *
FROM `educations`