app/Controllers/Admin/Organization.php

    public function index()
    {
        $data = ['title' => 'Manajemen Organisasi', 'organizations' => $this->orgModel->findAll()];
---
SELECT *
FROM `organizations`

    public function store()
    {
        // Validasi input termasuk file gambar (opsional, maks 2MB)
        if (!$this->validate([
            'organization_name' => 'required',
            'role'              => 'required',
            'period'            => 'required',
            'image'             => 'max_size[image,2048]|is_image[image]'
        ])) {
            return redirect()->back()->withInput();
        }

        // Handle upload gambar/logo organisasi
        $fileGambar = $this->request->getFile('image');
        $namaGambar = null;

        if ($fileGambar && $fileGambar->isValid() && !$fileGambar->hasMoved()) {
            $namaGambar = $fileGambar->getRandomName();
            $fileGambar->move(ROOTPATH . 'public/uploads', $namaGambar);
        }

        $this->orgModel->save([
            'organization_name' => $this->request->getPost('organization_name'),
            'role'              => $this->request->getPost('role'),
            'period'            => $this->request->getPost('period'),
            'description'       => $this->request->getPost('description'),
            'image'             => $namaGambar // Simpan nama file gambar
        ]);
---
INSERT INTO `organizations` (`organization_name`, `role`, `period`, `description`, `image`) VALUES ('kckxj', 'kjds', '2023', '', '1782480142_dbc28faed67375e80753.png')