app/Controllers/Admin/Profile.php

SELECT *
FROM `profile`
WHERE `profile`.`id` = 1
---
    public function index()
    {
        $model = new ProfileModel();
        $data['profile'] = $model->find(1);