app/Controllers/Admin/Skill.php

    public function index()
    {
        $data = [
            'title'  => 'Manajemen Keahlian',
            'skills' => $this->skillModel->findAll()
---
SELECT *
FROM `skills`