app/Controllers/Home.php

    public function index()
    {
        $projectModel      = new ProjectModel();
        $skillModel        = new SkillModel();
        $educationModel    = new EducationModel();
        $profileModel      = new \App\Models\ProfileModel();
        $organizationModel = new \App\Models\OrganizationModel(); // Tambahkan ini sekalian
        $certificateModel  = new \App\Models\CertificateModel();

        // Menggabungkan semua data ke dalam satu array tanpa menyimpannya
        $data = [
            'profile'       => $profileModel->find(1), // Hapus "this->" nya
            'projects'      => $projectModel->findAll(),
            'skills'        => $skillModel->findAll(),
            'education'     => $educationModel->orderBy('start_year', 'DESC')->findAll(),
            'organizations' => $organizationModel->findAll(),
            'certificates'  => $certificateModel->findAll()
---
SELECT *
FROM `projects`
SELECT *
FROM `skills`
SELECT *
FROM `educations`
ORDER BY `start_year` DESC
SELECT *
FROM `organizations`
SELECT *
FROM `certificates`